<template>
	<div ref="body">
		<div ref="print"  class="recordImg" id="printRecord" v-show="bool">
			<h2>老年人登记表</h2>
			<table border="1" cellspacing="1" cellpadding="1">
				<thead>
					<tr>
						<th>日期</th>
						<th>名字</th>
						<th>地址</th>
						<th v-for="item in listData">
							{{item}}
						</th>
					</tr>
				</thead>
				<tbody>
					<template v-for="value in tableData">
						<tr>
							<td>{{value.date}}</td>
							<td>{{value.name}}</td>
							<td>{{value.address}}</td>
							<td v-for="item in listData">
								{{value[item]}}
							</td>
						</tr>
					</template>
				</tbody>
			</table>
		</div>
		<el-button v-show="!bool" class="bu" style="margin: 30px;" type="primary" @click="print">打印</el-button>
	</div>
</template>

<script>
	import Printjs from "print-js";
	export default {
		data() {
			return {
				bool:false,
				tableData: [{
					date: '2016-05-11',
					name: '王小虎11',
					address: '上海市普陀区11',
					"自理一": 1,
					"自理二": 11,
					"自理三": 111,
					map: {
						"自理一": 1,
						"自理二": 11,
						"自理三": 111,
					},
				}, {
					date: '2016-05-22',
					name: '王小虎22',
					address: '上海市普陀区22',
					"自理一": 2,
					"自理二": 22,
					"自理三": 222,
					map: {
						"自理一": 2,
						"自理二": 22,
						"自理三": 222,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},{
					date: '2016-05-33',
					name: '王小虎33',
					address: '上海市普陀区33',
					"自理一": 3,
					"自理二": 33,
					"自理三": 333,
					map: {
						"自理一": 3,
						"自理二": 33,
						"自理三": 333,
					},
				},],
				listData:["自理一","自理二","自理三"]
			}
		},

		methods: {
			print() {
				// let newHtml = this.$refs.print.innerHTML;
				// let oldHtml = this.$refs.body.innerHTML;
				// // debugger
				// document.body.innerHTML = newHtml;
				// window.print();
				// window.location.reload();
				// document.body.innerHTML = oldHtml;
				// return false;
				new Promise(resolve=>{
					this.bool = true;
					resolve();
				}).then(res =>{
					return new Promise(resolve=>{
						window.print();
						resolve();
					})
				}).then(res=>{
					this.bool = false;
				})
				
			},
		}
	}
</script>
<style type="text/css">
	table {
		border-collapse: collapse;
		margin: 0 auto;
		width: 100%;
		text-align: center;
	}
	h2{
		text-align: center;
	}
	/* table th {
		width: 150px;
	}
	table tr{
		height: 50px;
	} */
</style>
